id,question,sparql,answer
77,┬┐Qu├® compa├▒├¡as de electr├│nica fueron fundadas en Pek├¡n?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> . ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Electronics> . ?uri <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Beijing> . },"[<http://dbpedia.org/resource/Greatview>, <http://dbpedia.org/resource/Sinosteel>, <http://dbpedia.org/resource/SuperMap>, <http://dbpedia.org/resource/Beijing_Mass_Transit_Railway_Operation_Corporation_Limited>, <http://dbpedia.org/resource/China_Central_Huijin>, <http://dbpedia.org/resource/China_National_Aero-Technology_Import_&_Export_Corporation>, <http://dbpedia.org/resource/Aluminum_Corporation_of_China_Limited>, <http://dbpedia.org/resource/CITS_Group_Corporation>, <http://dbpedia.org/resource/Aviation_Industry_Corporation_of_China>, <http://dbpedia.org/resource/Lenovo>, <http://dbpedia.org/resource/Foton_Motor>, <http://dbpedia.org/resource/China_Construction_Bank>, <http://dbpedia.org/resource/Datang_Telecom>, <http://dbpedia.org/resource/Industrial_and_Commercial_Bank_of_China>, <http://dbpedia.org/resource/Alpine_Data_Labs>, <http://dbpedia.org/resource/Xiaomi>, <http://dbpedia.org/resource/Bank_of_China>, <http://dbpedia.org/resource/China_National_Salt_Industry_Corporation>, <http://dbpedia.org/resource/China_Medical_Technologies>, <http://dbpedia.org/resource/Sinovel>, <http://dbpedia.org/resource/China_Petrochemical_Corporation>, <http://dbpedia.org/resource/BeijingWest_Industries>, <http://dbpedia.org/resource/BAW>, <http://dbpedia.org/resource/Qihoo>, <http://dbpedia.org/resource/Sanyuan_Group>, <http://dbpedia.org/resource/Safedom>, <http://dbpedia.org/resource/AcrossChina>, <http://dbpedia.org/resource/Sinopec>]"
78,Dame todos los videojuegos de Mean Hamster Software.,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
      ?uri rdf:type dbo:VideoGame .
      ?uri dbo:publisher res:Mean_Hamster_Software . 
}","[<http://dbpedia.org/resource/Crossbow_(video_game)>, <http://dbpedia.org/resource/Riven>]"
79,┬┐Cu├íntas tiendas Aldi hay?,SELECT DISTINCT ?number WHERE {  <http://dbpedia.org/resource/Aldi> <http://dbpedia.org/ontology/numberOfLocations> ?number . } ,"[""9235""^^xsd:nonNegativeInteger]"
80,┬┐Cu├íl es la capital de Camer├║n?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cameroon> <http://dbpedia.org/ontology/capital> ?uri. } ,[<http://dbpedia.org/resource/Yaound%C3%A9>]
81,┬┐Hay alg├║n videojuego que se llame Battle Chess?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
	?uri rdf:type dbo:VideoGame .
        ?uri rdfs:label 'Battle Chess'@en .
}",[true]
82,┬┐La mujer del presidente Lincoln se llama Mary?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        res:Abraham_Lincoln dbo:spouse ?spouse .
        ?spouse rdfs:label ?name .
        FILTER(regex(?name,'Mary')) 
}",[true]
83,Dame todas las pel├¡culas que haya dirigido Francis Ford Coppola.,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Francis_Ford_Coppola> . } ,"[<http://dbpedia.org/resource/Youth_Without_Youth_(film)>, <http://dbpedia.org/resource/Apocalypse_Now_Redux>, <http://dbpedia.org/resource/The_Rain_People>, <http://dbpedia.org/resource/The_Godfather_Part_III>, <http://dbpedia.org/resource/Tonight_for_Sure>, <http://dbpedia.org/resource/The_Cotton_Club_(film)>, <http://dbpedia.org/resource/One_from_the_Heart>, <http://dbpedia.org/resource/Tetro>, <http://dbpedia.org/resource/The_Bellboy_and_the_Playgirls>, <http://dbpedia.org/resource/Peggy_Sue_Got_Married>, <http://dbpedia.org/resource/The_Rainmaker_(1997_film)>, <http://dbpedia.org/resource/Dementia_13>, <http://dbpedia.org/resource/Jack_(1996_film)>, <http://dbpedia.org/resource/The_Godfather>, <http://dbpedia.org/resource/The_Godfather_Saga>, <http://dbpedia.org/resource/You're_a_Big_Boy_Now>, <http://dbpedia.org/resource/Apocalypse_Now>, <http://dbpedia.org/resource/Hammett_(film)>, <http://dbpedia.org/resource/The_Conversation>, <http://dbpedia.org/resource/The_Godfather_Part_II>, <http://dbpedia.org/resource/Battle_Beyond_the_Sun>, <http://dbpedia.org/resource/Tucker:_The_Man_and_His_Dream>, <http://dbpedia.org/resource/The_Terror_(1963_film)>, <http://dbpedia.org/resource/Rumble_Fish>, <http://dbpedia.org/resource/The_Godfather_(film_series)>, <http://dbpedia.org/resource/Twixt_(film)>, <http://dbpedia.org/resource/Gardens_of_Stone>, <http://dbpedia.org/resource/Bram_Stoker's_Dracula>, <http://dbpedia.org/resource/The_Outsiders_(film)>, <http://dbpedia.org/resource/New_York_Stories>]"
84,┬┐Cu├íl es la pel├¡cula de Tim Burton con el mayor presupuesto?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:director res:Tim_Burton .
        ?uri dbo:budget ?b .
}
ORDER BY ?b
OFFSET 0 LIMIT 1",[<http://dbpedia.org/resource/Big_Eyes>]
85,┬┐Tiene Breaking Bad m├ís episodios que Game of Thrones?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Breaking_Bad dbo:numberOfEpisodes ?x . 
        res:Game_of_Thrones dbo:numberOfEpisodes ?y . 
        FILTER (?y > ?x) 
}",[true]
86,┬┐Quien se llamaba Rodzilla?,"PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri dbp:nickname ""Rodzilla""@en .
}",[<http://dbpedia.org/resource/Rodney_Blake>]
87,┬┐Naci├│ Natalie Portman en los estados unidos de am├®rica?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE { 
	res:Natalie_Portman dbo:birthPlace ?city .
      	?city dbo:country res:United_States .
}",[true]
88,Dame todos los nietos de Elvis Presley.,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?child . ?child <http://dbpedia.org/ontology/child> ?uri . },[<http://dbpedia.org/resource/Riley_Keough>]
90,┬┐Cuando muri├│ el creador de Dr├ícula?,SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Count_Dracula> <http://dbpedia.org/ontology/creator> ?x .  ?x <http://dbpedia.org/ontology/deathDate> ?date . } ,"[""1912-04-20""^^xsd:date]"
91,┬┐De qu├® pa├¡s viene el creador de Nijntje?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:Miffy dbo:creator ?x .
	?x dbo:nationality ?uri .
}",[<http://dbpedia.org/resource/Netherlands>]
92,┬┐Cu├íl es el verdadero nombre de Batman?,SELECT DISTINCT ?s WHERE { <http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/alterEgo> ?s . },"[""Bruce Wayne""@en]"
93,┬┐Qu├® forma de gobierno tiene Rusia?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Russia> <http://dbpedia.org/ontology/governmentType> ?uri . } ,[<http://dbpedia.org/resource/Federalism>]
94,┬┐Cuantas compa├▒├¡as han sido fundadas por el fundador de Facebook?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Facebook> <http://dbpedia.org/ontology/foundedBy> ?uri .  ?uri <http://dbpedia.org/ontology/foundedBy> ?uri . } ,[0]
95,Dame todos las empresas canadienses productoras de m├║sica Grunge.,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type dbo:RecordLabel .
        ?uri dbo:genre res:Grunge .
        ?uri dbo:country res:Canada .
}",[<http://dbpedia.org/resource/Murderecords>]
96,┬┐Cu├íntos hijos tuvo Benjamin Franklin?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Benjamin_Franklin> <http://dbpedia.org/ontology/child> ?uri . } ,[3]
97,Dame una lista de los hijos de Margaret Thatcher.,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
	res:Margaret_Thatcher dbo:child ?uri .
}","[<http://dbpedia.org/resource/Carol_Thatcher>, <http://dbpedia.org/resource/Mark_Thatcher>]"
98,┬┐De que regi├│n es el vino Melon de Bourgogne?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        res:Melon_de_Bourgogne dbo:wineRegion ?uri .
}","[<http://dbpedia.org/resource/Loire_Valley_(wine)>, <http://dbpedia.org/resource/Oregon>, <http://dbpedia.org/resource/Southern_Ontario>, <http://dbpedia.org/resource/Washington_(state)>]"
99,┬┐Cu├íl es el hijo mas mayor de Meryl Streep?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Meryl_Streep dbo:child ?uri . 
        ?uri dbo:birthDate ?d .
}
ORDER BY ASC(?d)
OFFSET 0 LIMIT 1",[<http://dbpedia.org/resource/Henry_Wolfe_Gummer>]
100,┬┐Son las ranas verdes un tipo de anfibio?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Hylidae dbo:class res:Amphibian . 
}",[true]
101,┬┐Act├║a Christian Bale en Velvet Goldmine?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE {
        res:Velvet_Goldmine dbo:starring res:Christian_Bale .
}",[true]
102,Dame todos los juegos de GMT.,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {	
        ?uri dbo:publisher res:GMT_Games .
}","[<http://dbpedia.org/resource/Twilight_Struggle>, <http://dbpedia.org/resource/Washington's_War>, <http://dbpedia.org/resource/Chandragupta_(board_game)>, <http://dbpedia.org/resource/Paths_of_Glory_(board_game)>, <http://dbpedia.org/resource/Fields_of_Fire_(game)>, <http://dbpedia.org/resource/Sword_of_Rome>, <http://dbpedia.org/resource/Commands_&_Colors:_Ancients>]"
103,┬┐Desemboca el Isar en un lago?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK
WHERE {
        ?x dbo:inflow res:Isar .
        ?x rdf:type dbo:Lake . 
}",[true]
104,┬┐Qu├® aeropuertos sirve Yeti Airlines?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Yeti_Airlines> <http://dbpedia.org/ontology/targetAirport> ?uri . },"[<http://dbpedia.org/resource/Pokhara>,<http://dbpedia.org/resource/Siddharthanagar>,<http://dbpedia.org/resource/Biratnagar>]"
105,┬┐Qu├® empresa de la India tiene el mayor n├║mero de empleados?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> . ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/India> . ?uri <http://dbpedia.org/ontology/numberOfEmployees> ?n . } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,[<http://dbpedia.org/resource/Indian_Railways>]
106,┬┐Qu├® color expresa lealtad?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/connotation> <http://dbpedia.org/resource/Loyalty> . },[<http://dbpedia.org/resource/Indigo>]
107,┬┐Que ciudad tiene la mayor poblaci├│n?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:City . 
         ?uri dbo:populationTotal ?pop . 
}
ORDER BY DESC(?pop)
OFFSET 0 LIMIT 1",[<http://dbpedia.org/resource/Karachi>]
108,┬┐Qui├®n cre├│ Wikipedia?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	res:Wikipedia dbo:author ?uri .
}","[<http://dbpedia.org/resource/Jimmy_Wales>, <http://dbpedia.org/resource/Larry_Sanger>]"
109,┬┐Es Rita Wilson la esposa de Tom Hanks?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Tom_Hanks dbo:spouse res:Rita_Wilson . 
}",[true]
110,┬┐La mujer del presidente Obama se llama Michelle?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        res:Barack_Obama dbo:spouse ?spouse .
        ?spouse rdfs:label ?name .
        FILTER(regex(?name,'Michelle')) 
}",[true]
111,┬┐Cu├íntos grupos ├®tnicos viven en Eslovenia?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Slovenia> <http://dbpedia.org/ontology/ethnicGroup> ?uri . } ,[4]
112,┬┐Qui├®n es el presidente de Eritrea?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Eritrea> <http://dbpedia.org/ontology/leader> ?uri . <http://dbpedia.org/resource/Eritrea> <http://dbpedia.org/ontology/leaderTitle> 'President'@en . }  ,[<http://dbpedia.org/resource/Isaias_Afwerki>]
113,┬┐Qu├® pel├¡culas dirigio Stanley Kubrick?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Stanley_Kubrick> . },"[<http://dbpedia.org/resource/Lolita_(1962_film)>, <http://dbpedia.org/resource/The_Shining_(film)>, <http://dbpedia.org/resource/Paths_of_Glory>, <http://dbpedia.org/resource/Eyes_Wide_Shut>, <http://dbpedia.org/resource/The_Seafarers>, <http://dbpedia.org/resource/2001:_A_Space_Odyssey_(film)>, <http://dbpedia.org/resource/A_Clockwork_Orange_(film)>, <http://dbpedia.org/resource/Fear_and_Desire>, <http://dbpedia.org/resource/Barry_Lyndon>, <http://dbpedia.org/resource/Spartacus_(film)>, <http://dbpedia.org/resource/The_Killing_(film)>, <http://dbpedia.org/resource/Flying_Padre>, <http://dbpedia.org/resource/Dr._Strangelove>, <http://dbpedia.org/resource/Day_of_the_Fight>, <http://dbpedia.org/resource/Full_Metal_Jacket>, <http://dbpedia.org/resource/Killer's_Kiss>]"
114,┬┐Cuando se completo el Titanic?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date
WHERE { 
        res:RMS_Titanic dbo:completionDate ?date . 
}","[""1912-04-02""^^xsd:date]"
115,┬┐Cu├íntas p├íginas tiene Guerra y Paz?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?n
WHERE {
        res:War_and_Peace dbo:numberOfPages ?n .
}","[""1225""^^xsd:positiveInteger]"
116,┬┐Qui├®n es el jugador m├ís j├│ven de la Premier League?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:team ?x . 
        ?x dbo:league res:Premier_League . 
        ?uri dbo:birthDate ?y . 
} 
ORDER BY DESC(?y) 
OFFSET 0 LIMIT 1",[<http://dbpedia.org/resource/Ernie_Pinkney>]
117,┬┐Cu├íl es la monta├▒a mas alta en Italia?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Mountain .
        ?uri dbo:locatedInArea res:Italy .
        ?uri dbo:elevation ?num .
}
ORDER BY DESC(?num)
OFFSET 0 LIMIT 1",[<http://dbpedia.org/resource/Mont_Blanc>]
118,┬┐C├│mo de alta es Claudia Schiffer?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?height 
WHERE {       
        res:Claudia_Schiffer dbo:height ?height .      
}","[""1.81""^^xsd:double]"
119,┬┐Qui├®n fu├® el vicepresidente de John F. Kennedy?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { res:John_F._Kennedy dbo:vicePresident ?uri . 
}",[<http://dbpedia.org/resource/Lyndon_B._Johnson>]
120,┬┐Qu├® subsidiario de Lufthansa vuela en Dortmund y en Berlin?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri 
WHERE {
        res:Lufthansa dbo:subsidiary ?uri .
        ?uri dbo:targetAirport res:Dortmund_Airport .
        ?uri dbo:targetAirport res:Berlin_Tegel_Airport .
}","[<http://dbpedia.org/resource/JetBlue>, <http://dbpedia.org/resource/SunExpress>, <http://dbpedia.org/resource/Brussels_Airlines>, <http://dbpedia.org/resource/Eurowings>, <http://dbpedia.org/resource/Lufthansa_Regional>, <http://dbpedia.org/resource/LSG_Sky_Chefs>, <http://dbpedia.org/resource/AeroLogic>, <http://dbpedia.org/resource/Tyrolean_Airways>, <http://dbpedia.org/resource/Swiss_European_Air_Lines>, <http://dbpedia.org/resource/Lufthansa_Cargo>, <http://dbpedia.org/resource/Lufthansa_Systems>, <http://dbpedia.org/resource/Lufthansa_Technik>, <http://dbpedia.org/resource/Lufthansa_Consulting>, <http://dbpedia.org/resource/Global_Load_Control>, <http://dbpedia.org/resource/Swiss_International_Air_Lines>, <http://dbpedia.org/resource/Air_Dolomiti>, <http://dbpedia.org/resource/Edelweiss_Air>, <http://dbpedia.org/resource/Lufthansa_CityLine>, <http://dbpedia.org/resource/Austrian_Airlines>, <http://dbpedia.org/resource/Luxair>, <http://dbpedia.org/resource/Lufthansa_Flight_Training>, <http://dbpedia.org/resource/Germanwings>]"
121,┬┐Qui├®n fu├® el sucesor de John F. Kennedy?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:John_F._Kennedy dbo:successor ?uri .
}","[<http://dbpedia.org/resource/Benjamin_A._Smith_II>, <http://dbpedia.org/resource/Lyndon_B._Johnson>, <http://dbpedia.org/resource/Tip_O'Neill>]"
122,┬┐Qui├®n compuso la banda sonora del Titanic de Cameron?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Titanic_(1997_film)> <http://dbpedia.org/ontology/musicComposer> ?uri . } ,[<http://dbpedia.org/resource/James_Horner>]
123,┬┐Qu├® pel├¡culas ha rodado Kurosawa?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:director res:Akira_Kurosawa .
}","[<http://dbpedia.org/resource/Horse_(1941_film)>, <http://dbpedia.org/resource/The_Men_Who_Tread_on_the_Tiger's_Tail>, <http://dbpedia.org/resource/Yojimbo_(film)>, <http://dbpedia.org/resource/Ran_(film)>, <http://dbpedia.org/resource/Dersu_Uzala_(1975_film)>, <http://dbpedia.org/resource/Madadayo>, <http://dbpedia.org/resource/One_Wonderful_Sunday>, <http://dbpedia.org/resource/The_Idiot_(1951_film)>, <http://dbpedia.org/resource/The_Quiet_Duel>, <http://dbpedia.org/resource/Seven_Samurai>, <http://dbpedia.org/resource/High_and_Low_(1963_film)>, <http://dbpedia.org/resource/Ikiru>, <http://dbpedia.org/resource/Scandal_(1950_film)>, <http://dbpedia.org/resource/Stray_Dog_(film)>, <http://dbpedia.org/resource/Throne_of_Blood>, <http://dbpedia.org/resource/Sanshiro_Sugata_Part_II>, <http://dbpedia.org/resource/Sanjuro>, <http://dbpedia.org/resource/Red_Beard>, <http://dbpedia.org/resource/Sanshiro_Sugata>, <http://dbpedia.org/resource/No_Regrets_for_Our_Youth>, <http://dbpedia.org/resource/Those_Who_Make_Tomorrow>, <http://dbpedia.org/resource/The_Lower_Depths_(1957_film)>, <http://dbpedia.org/resource/The_Most_Beautiful>, <http://dbpedia.org/resource/Kagemusha>, <http://dbpedia.org/resource/Dreams_(1990_film)>, <http://dbpedia.org/resource/I_Live_in_Fear>, <http://dbpedia.org/resource/Rashomon>, <http://dbpedia.org/resource/The_Hidden_Fortress>, <http://dbpedia.org/resource/The_Bad_Sleep_Well>, <http://dbpedia.org/resource/Drunken_Angel>, <http://dbpedia.org/resource/Rhapsody_in_August>, <http://dbpedia.org/resource/Dodes'ka-den>]"
124,┬┐Qu├® discogr├ífica grab├│ el primer album de Elvis?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdf:type dbo:Album .
        ?x dbo:artist res:Elvis_Presley .
        ?x dbo:releaseDate ?y .
        ?x dbo:recordLabel ?uri .
}
ORDER BY ASC(?y) 
OFFSET 0 LIMIT 1",[<http://dbpedia.org/resource/Pickwick_Records>]
125,┬┐En qu├® zona horaria esta Roma?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/timeZone> ?uri . } ,[<http://dbpedia.org/resource/Central_European_Time>]
126,┬┐Cual es la moneda de China?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {  
   res:China dbo:currency ?uri . 
}",[<http://dbpedia.org/resource/Renminbi>]
127,┬┐Qui├®nes son los desarrolladores de DBpedia?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/DBpedia> <http://dbpedia.org/ontology/developer> ?uri . },"[<http://dbpedia.org/resource/Free_University_of_Berlin>, <http://dbpedia.org/resource/Leipzig_University>, <http://dbpedia.org/resource/OpenLink_Software>]"
128,┬┐Tiene el lugar de nacimiento de Abraham Lincol una p├ígina web?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:Abraham_Lincoln dbo:deathPlace ?p .
        ?p dbo:website ?w . 
}",[true]
129,┬┐Qui├®n es el rey de los Pa├¡ses Bajos?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Netherlands> <http://dbpedia.org/ontology/leader> ?uri . ?uri a <http://dbpedia.org/ontology/Royalty> . } ,"[<http://dbpedia.org/resource/Mark_Rutte>, <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>]"
130,┬┐En que ciudad muri├│ Nikos Kazantzakis?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Nikos_Kazantzakis> <http://dbpedia.org/ontology/deathPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Town> . },"[<http://dbpedia.org/resource/Freiburg_im_Breisgau>, <http://dbpedia.org/resource/Germany>, <http://dbpedia.org/resource/West_Germany>]"
131,┬┐Qui├®n fue el padre de la reina Isabel II?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri
WHERE { 
        res:Elizabeth_II dbp:father ?uri .
}",[<http://dbpedia.org/resource/George_VI>]
133,┬┐Cu├íntos habitantes tiene la ciudad m├ís grande de Canad├í?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num
WHERE {
        res:Canada dbo:largestCity ?city . 
        ?city dbo:populationTotal ?num .
}","[""2615060""^^xsd:nonNegativeInteger]"
134,┬┐En qu├® conflictos militares particip├│ Lawrence de Arabia?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:T._E._Lawrence dbo:battle ?uri . 
}","[<http://dbpedia.org/resource/Battle_of_Megiddo_(1918)>, <http://dbpedia.org/resource/Battle_of_Aqaba>, <http://dbpedia.org/resource/Battle_of_Aba_el_Lissan>, <http://dbpedia.org/resource/World_War_I>, <http://dbpedia.org/resource/Siege_of_Medina>, <http://dbpedia.org/resource/Arab_Revolt>, <http://dbpedia.org/resource/Capture_of_Damascus_(1918)>, <http://dbpedia.org/resource/Battle_of_Deraa>, <http://dbpedia.org/resource/Battle_of_Talifeh>, <http://dbpedia.org/resource/Battle_of_Fwelia>]"
135,┬┐Que libro tiene el mayor numero de paginas?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Book . 
        ?uri dbo:numberOfPages ?n .
}
ORDER BY DESC(?n)
OFFSET 0 LIMIT 1",[<http://dbpedia.org/resource/The_Tolkien_Reader>]
136,┬┐En qu├® pa├¡s nace el Nilo?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Nile dbo:sourceCountry ?uri .
}","[<http://dbpedia.org/resource/Ethiopia>, <http://dbpedia.org/resource/Rwanda>]"
137,┬┐Qui├®n es el conductor de Formula 1 con m├ís carreras?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FormulaOneRacer> .  ?uri <http://dbpedia.org/ontology/races> ?x . } ORDER BY DESC(?x) OFFSET 0 LIMIT 1 ,[<http://dbpedia.org/resource/Michael_Schumacher>]
138,┬┐Qu├® compa├▒├¡as producen aerodeslizadores?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> . ?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Hovercraft> . },[http://dbpedia.org/resource/Slack_Technologies]
139,Tuvo hijos Elvis Presley?,ASK WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?uri . } ,[true]
140,┬┐En que ciudad naci├│ el presidente de Montenegro?,SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/office> <http://dbpedia.org/resource/President_of_Montenegro> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri . ?uri a <http://dbpedia.org/ontology/City> . } ,"[<http://dbpedia.org/resource/Belgrade>, <http://dbpedia.org/resource/Socialist_Federal_Republic_of_Yugoslavia>, <http://dbpedia.org/resource/Socialist_Republic_of_Serbia>, <http://dbpedia.org/resource/Nikšić>, <http://dbpedia.org/resource/Socialist_Republic_of_Montenegro>]"
141,┬┐En qu├® pa├¡s naci├│ Bill Gates?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bill_Gates> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri . },[<http://dbpedia.org/resource/United_States>]
142,┬┐En qu├® pa├¡ses se habla japon├®s?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Japanese_language> . } ,[<http://dbpedia.org/resource/Japan>]
143,Mu├®strame el libro escrito por Muhammad Ali.,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri rdf:type dbo:Book . 
         ?uri dbo:author res:Muhammad_Ali . 
}",[<http://dbpedia.org/resource/The_Soul_of_a_Butterfly>]
144,┬┐Es Michele Obama la esposa de Barack Obama?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	res:Barack_Obama dbo:spouse res:Michelle_Obama .
}",[true]
145,┬┐Cu├íl es el prefijo de Berlin?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE {
	res:Berlin dbo:areaCode ?string .
}","[""030""]"
146,Dame todos los actores que hayan actuado en Last Action Hero.,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Last_Action_Hero dbo:starring ?uri . 
}","[<http://dbpedia.org/resource/Anthony_Quinn>, <http://dbpedia.org/resource/Arnold_Schwarzenegger>, <http://dbpedia.org/resource/Art_Carney>, <http://dbpedia.org/resource/Austin_O'Brien>, <http://dbpedia.org/resource/Bridgette_Wilson>, <http://dbpedia.org/resource/Charles_Dance>, <http://dbpedia.org/resource/F._Murray_Abraham>, <http://dbpedia.org/resource/Robert_Prosky>, <http://dbpedia.org/resource/Tom_Noonan>]"
147,┬┐Cu├íl es el apodo de San Francisco?,SELECT DISTINCT ?string WHERE {  <http://dbpedia.org/resource/San_Francisco> <http://dbpedia.org/property/nickname> ?string . } ,"[""The City by the Bay; Fog City; San Fran; Frisco; The City that Knows How ; Baghdad by the Bay ; The Paris of the West""@en]"
148,┬┐Cu├íl fue el primer ├ílbum de Queen?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Album> . ?uri <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Queen_(band)> . ?uri <http://dbpedia.org/ontology/releaseDate> ?d . } ORDER BY ASC(?d) OFFSET 0 LIMIT 1,[<http://dbpedia.org/resource/Queen_(Queen_album)>]
149,┬┐Por qu├® pa├¡ses fluye el r├¡o Yenisei?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
        res:Yenisei_River dbp:country ?uri .
}","[<http://dbpedia.org/resource/Russia>,<http://dbpedia.org/resource/Mongolia>]"
150,┬┐Qu├® series televisivas ide├│ Walt Disney?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
	?uri rdf:type dbo:TelevisionShow .
        ?uri dbo:creator res:Walt_Disney .
}","[<http://dbpedia.org/resource/Figaro_(Disney)>, <http://dbpedia.org/resource/Oswald_the_Lucky_Rabbit>, <http://dbpedia.org/resource/The_Mickey_Mouse_Club>, <http://dbpedia.org/resource/Pete_Junior>, <http://dbpedia.org/resource/Evil_Queen_(Disney)>, <http://dbpedia.org/resource/Ludwig_Von_Drake>, <http://dbpedia.org/resource/Clarabelle_Cow>, <http://dbpedia.org/resource/List_of_Jiminy_Cricket_educational_serials>, <http://dbpedia.org/resource/Mickey_Mouse>, <http://dbpedia.org/resource/Mickey_Mouse_Clubhouse>, <http://dbpedia.org/resource/Minnie_Mouse>, <http://dbpedia.org/resource/Humphrey_the_Bear>, <http://dbpedia.org/resource/Louie_the_Mountain_Lion>, <http://dbpedia.org/resource/Goofy>, <http://dbpedia.org/resource/Horace_Horsecollar>, <http://dbpedia.org/resource/Pete_(Disney)>, <http://dbpedia.org/resource/Donald_Duck>, <http://dbpedia.org/resource/Julius_the_Cat>]"
151,┬┐Qu├® puente tiene el mayor largo del vano?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Bridge .
        ?uri dbo:mainspan ?s . 
} 
ORDER BY DESC(?s) 
OFFSET 0 LIMIT 1",[<http://dbpedia.org/resource/Overseas_Highway>]
152,┬┐De qu├® pa├¡s es Sitecore?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sitecore> <http://dbpedia.org/ontology/foundationPlace> ?uri . },[<http://dbpedia.org/resource/Denmark>]
153,┬┐Con quien se cas├│ Lance Bass?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Lance_Bass> . } ,[<http://dbpedia.org/resource/Michael_Turchin>]
154,┬┐Cu├íl es la capital de Canad├í?,"PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Canada dbo:capital ?uri .
}",[<http://dbpedia.org/resource/Ottawa>]
155,┬┐Qui├®n inspiro a Vincent van Gogh?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/influenced> <http://dbpedia.org/resource/Vincent_van_Gogh> . },"[<http://dbpedia.org/resource/Adolphe_Joseph_Thomas_Monticelli>, <http://dbpedia.org/resource/Anton_Mauve>]"
156,┬┐En qu├® ciudad muri├│ John F. Kennedy?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
        res:John_F._Kennedy dbo:deathPlace ?uri .
        ?uri rdf:type dbo:City .
}","[<http://dbpedia.org/resource/Dallas>, <http://dbpedia.org/resource/Texas>]"
158,┬┐Qui├®n escribi├│ el tema del Juego de Tronos?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Game_of_Thrones> <http://dbpedia.org/ontology/composer> ?uri. },[<http://dbpedia.org/resource/Ramin_Djawadi>]
159,┬┐Qui├®n dise├▒├│ la Brooklyn Bridge?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Brooklyn_Bridge dbo:architect ?uri .
}",[<http://dbpedia.org/resource/John_A._Roebling>]
160,┬┐Cu├índo termino Boris Becker su carrera como actor?,SELECT DISTINCT ?d WHERE { <http://dbpedia.org/resource/Boris_Becker> <http://dbpedia.org/ontology/activeYearsEndDate> ?d . } ,"[""1999-06-30""^^xsd:date]"
