id,question,sparql,answer
0,┬┐Cu├índo tuvo lugar la batalla de Gettysburg?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE { 
       res:Battle_of_Gettysburg dbo:date ?date .
}","[""1863-07-03""^^xsd:date]"
1,Dame todos los musicales con m├║sica de Elton John.,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Musical .
        ?uri dbo:musicBy res:Elton_John .
}","[<http://dbpedia.org/resource/Aida_(musical)>, <http://dbpedia.org/resource/The_Lion_King_(musical)>, <http://dbpedia.org/resource/Billy_Elliot_the_Musical>, <http://dbpedia.org/resource/Lestat_(musical)>]"
2,┬┐C├│mo de alta el faro de Colombo?,SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Colombo_Lighthouse> <http://dbpedia.org/ontology/height> ?num . } ,"[""29.0""^^xsd:double]"
3,┬┐Qui├®n fu├® la mujer del presidente americano Lincoln?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:Abraham_Lincoln dbo:spouse ?uri.
}",[<http://dbpedia.org/resource/Mary_Todd_Lincoln>]
4,┬┐Qui├®n es el anfitri├│n de los especiales de la BBC Wildlife?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/BBC_Wildlife_Specials> <http://dbpedia.org/ontology/presenter> ?uri . },[<http://dbpedia.org/resource/David_Attenborough>]
5,┬┐Cuanto costo Pulp Fiction?,SELECT DISTINCT ?n WHERE {  <http://dbpedia.org/resource/Pulp_Fiction> <http://dbpedia.org/ontology/budget> ?n . } ,"[""8500000.0""^^<http://dbpedia.org/datatype/usDollar>]"
6,┬┐En qu├® ciudad esta la f├íbrica de cerveza Heineken?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heineken> <http://dbpedia.org/ontology/manufacturer> ?x . ?x <http://dbpedia.org/ontology/locationCity> ?uri . },[<http://dbpedia.org/resource/Amsterdam>]
7,┬┐Cu├índo comenz├│ la operaci├│n Overlord?,SELECT DISTINCT ?d WHERE { <http://dbpedia.org/resource/Operation_Overlord> <http://dbpedia.org/ontology/date> ?d . } ,"[""1944-08-25""^^xsd:date]"
8,┬┐En que ciudad termina la ruta Chilena 68?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Chile_Route_68> <http://dbpedia.org/ontology/routeEnd> ?uri . } ,[<http://dbpedia.org/resource/Valpara%C3%ADso>]
9,┬┐Quien desarroll├│ Slack?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Slack_(software)> . },[http://dbpedia.org/resource/Slack_Technologies]
10,┬┐Qui├®n estuvo casado con el presidente Chirac?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri
WHERE { 
         res:Jacques_Chirac dbo:spouse ?uri .
}",[<http://dbpedia.org/resource/Bernadette_Chirac>]
11,┬┐De qu├® muri├│ Bruce Carver?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
        res:Bruce_Carver dbo:deathCause ?uri .     
}",[<http://dbpedia.org/resource/Cancer>]
12,┬┐Qui├®n pint├│ el Cristo en la tormenta en el lago de Galilea?,"PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:The_Storm_on_the_Sea_of_Galilee dbp:artist ?uri .
}",[<http://dbpedia.org/resource/Rembrandt>]
13,┬┐Por qu├® ciudades pasa el r├¡o Weser?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Weser> <http://dbpedia.org/ontology/city> ?uri . } ,"[<http://dbpedia.org/resource/Bremen>, <http://dbpedia.org/resource/Bremerhaven>, <http://dbpedia.org/resource/Fulda_(river)>, <http://dbpedia.org/resource/Hamelin>, <http://dbpedia.org/resource/Hann._M%C3%BCnden>, <http://dbpedia.org/resource/Kassel>, <http://dbpedia.org/resource/Minden>]"
14,┬┐Cu├íntos asientos tiene el estadio del FC Porto?,SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/FC_Porto> <http://dbpedia.org/ontology/ground> ?x . ?x <http://dbpedia.org/ontology/seatingCapacity> ?n . } ,[50035]
15,┬┐Con qui├®n est├í casada la hija de Robert Kennedy?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Robert_F._Kennedy> <http://dbpedia.org/ontology/child> ?child .  ?child <http://dbpedia.org/ontology/spouse> ?uri . } ,[<http://dbpedia.org/resource/Andrew_Cuomo>]
16,┬┐Qu├® libros de Kerouac han sido publicados por Viking Press?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> .  ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Viking_Press> .  ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Jack_Kerouac> . } ,"[<http://dbpedia.org/resource/Book_of_Haikus>, <http://dbpedia.org/resource/Orpheus_Emerged>, <http://dbpedia.org/resource/Old_Angel_Midnight>, <http://dbpedia.org/resource/Beat_Generation_(play)>, <http://dbpedia.org/resource/The_Subterraneans>, <http://dbpedia.org/resource/Atop_an_Underwood:_Early_Stories_and_Other_Writings>, <http://dbpedia.org/resource/The_Sea_is_My_Brother>, <http://dbpedia.org/resource/Good_Blonde_&_Others>, <http://dbpedia.org/resource/Scattered_Poems>, <http://dbpedia.org/resource/Tristessa>, <http://dbpedia.org/resource/Book_of_Dreams_(novel)>, <http://dbpedia.org/resource/Book_of_Sketches>, <http://dbpedia.org/resource/Lonesome_Traveler>, <http://dbpedia.org/resource/Door_Wide_Open>, <http://dbpedia.org/resource/On_the_Road>, <http://dbpedia.org/resource/The_Dharma_Bums>, <http://dbpedia.org/resource/Desolation_Angels_(novel)>, <http://dbpedia.org/resource/And_the_Hippos_Were_Boiled_in_Their_Tanks>, <http://dbpedia.org/resource/Visions_of_Gerard>, <http://dbpedia.org/resource/Visions_of_Cody>, <http://dbpedia.org/resource/Big_Sur_(novel)>, <http://dbpedia.org/resource/Doctor_Sax>, <http://dbpedia.org/resource/Maggie_Cassidy>, <http://dbpedia.org/resource/Satori_in_Paris>, <http://dbpedia.org/resource/The_Town_and_the_City>, <http://dbpedia.org/resource/Mexico_City_Blues>, <http://dbpedia.org/resource/Pic_(novel)>, <http://dbpedia.org/resource/Vanity_of_Duluoz>, <http://dbpedia.org/resource/References_in_On_the_Road>]"
17,┬┐C├│mo de alta es Amazon Eve?,SELECT DISTINCT ?height WHERE {  <http://dbpedia.org/resource/Amazon_Eve> <http://dbpedia.org/ontology/height> ?height . } ,"[""2.02""^^xsd:double]"
18,┬┐En qu├® museo est├í expuesto el Grito de Munch?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
       res:The_Scream dbo:museum ?uri .
}",[<http://dbpedia.org/resource/National_Gallery_(Norway)>]
19,┬┐Quen escribi├│ el libro Los pilares de la Tierra?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:The_Pillars_of_the_Earth dbo:author ?uri .
}",[<http://dbpedia.org/resource/Ken_Follett>]
20,┬┐Est├í James Bond casado?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:James_Bond dbo:spouse ?uri . 
}",[true]
21,┬┐Qui├®n descubri├│ Ceres?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ceres_(dwarf_planet)> <http://dbpedia.org/ontology/discoverer> ?uri . },[<http://dbpedia.org/resource/Giuseppe_Piazzi>]
22,┬┐Por qu├® r├¡o cruza la Brooklyn Bridge?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Brooklyn_Bridge dbo:crosses ?uri . 
}",[<http://dbpedia.org/resource/East_River>]
23,┬┐Qui├®n era llamado Frank The Tank?,"PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbp:nickname 'Frank The Tank'@en . 
}",[<http://dbpedia.org/resource/Frank_Young_(basketball)>]
24,┬┐Cu├íl es el pa├¡s m├ís grande del mundo?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/ontology/areaTotal> ?n . } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,[<http://dbpedia.org/resource/Organization_for_Security_and_Co-operation_in_Europe>]
25,┬┐Qui├®n es el alcalde de Par├¡s?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paris> <http://dbpedia.org/ontology/mayor> ?uri . },[<http://dbpedia.org/resource/Anne_Hidalgo>]
26,┬┐Qui├®n es el entrenador del equipo de hockey sobre hielo de Ankara?,SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Ankara> . ?x <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Turkish_Ice_Hockey_First_League> . ?x <http://dbpedia.org/ontology/coach> ?uri . },[<http://dbpedia.org/resource/%C4%B0brahim_O%C4%9Fuz>]
27,┬┐Quien es el alcalde de la capital de la Polinesia Francesa?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:French_Polynesia dbo:capital ?x .
        ?x dbo:mayor ?uri .
}",[<http://dbpedia.org/resource/Michel_Buillard>]
28,┬┐Qu├® premios ha ganado Douglas Hofstadter?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
        res:Douglas_Hofstadter dbo:award ?uri .
}","[<http://dbpedia.org/resource/American_Academy_of_Arts_and_Sciences>, <http://dbpedia.org/resource/National_Book_Award>, <http://dbpedia.org/resource/Pulitzer_Prize>]"
29,┬┐Cu├ínto cuesta la pel├¡cula de Lego?,SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/The_Lego_Movie> <http://dbpedia.org/ontology/budget> ?n . } ,"[""6.0E7""^^<http://dbpedia.org/datatype/usDollar>]"
30,┬┐D├│nde empieza Piccadilly?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/routeStart> <http://dbpedia.org/resource/Piccadilly>. } ,[<http://dbpedia.org/resource/Dover_Street>]
31,┬┐Tienen el pr├¡ncipe Harry y el pr├¡nciple William la misma madre?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
ASK
WHERE { 
        <http://dbpedia.org/resource/Prince_William,_Duke_of_Cambridge> dbo:parent ?x . 
        <http://dbpedia.org/resource/Prince_Harry> dbo:parent ?x .
}",[true]
32,┬┐Quien actu├│ como el agente Smith en Matrix?,"PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Agent_Smith dbp:portrayer ?uri . 
}","[<http://dbpedia.org/resource/Hugo_Weaving>, <http://dbpedia.org/resource/Ian_Bliss>]"
33,┬┐Cu├íntos idiomas se hablan en Turkmenist├ín?,SELECT (COUNT(DISTINCT ?x) as ?c) WHERE {  <http://dbpedia.org/resource/Turkmenistan> <http://dbpedia.org/ontology/language> ?x . } ,[2]
34,┬┐En qu├® pel├¡culas act├║an Julia Roberts y Richard Gere?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Julia_Roberts> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Richard_Gere> . } ,"[<http://dbpedia.org/resource/Runaway_Bride_(1999_film)>, <http://dbpedia.org/resource/The_Ant_Bully_(film)>, <http://dbpedia.org/resource/Valentine's_Day_(2010_film)>, <http://dbpedia.org/resource/Fireflies_in_the_Garden>, <http://dbpedia.org/resource/The_Pelican_Brief_(film)>, <http://dbpedia.org/resource/Mystic_Pizza>, <http://dbpedia.org/resource/Mirror_Mirror_(film)>, <http://dbpedia.org/resource/Hook_(film)>, <http://dbpedia.org/resource/I_Love_Trouble_(1994_film)>, <http://dbpedia.org/resource/Steel_Magnolias>, <http://dbpedia.org/resource/Notting_Hill_(film)>, <http://dbpedia.org/resource/Ocean's_Twelve>, <http://dbpedia.org/resource/Full_Frontal_(film)>, <http://dbpedia.org/resource/Pretty_Woman>, <http://dbpedia.org/resource/The_Normal_Heart_(film)>, <http://dbpedia.org/resource/Pr%C3%AAt-%C3%A0-Porter_(film)>, <http://dbpedia.org/resource/August:_Osage_County_(film)>, <http://dbpedia.org/resource/Closer_(2004_film)>, <http://dbpedia.org/resource/Erin_Brockovich_(film)>, <http://dbpedia.org/resource/Dying_Young>, <http://dbpedia.org/resource/Eat_Pray_Love>, <http://dbpedia.org/resource/My_Best_Friend's_Wedding>, <http://dbpedia.org/resource/Charlotte's_Web_(2006_film)>, <http://dbpedia.org/resource/Duplicity_(film)>, <http://dbpedia.org/resource/Stepmom_(film)>, <http://dbpedia.org/resource/Satisfaction_(film)>, <http://dbpedia.org/resource/Flatliners>, <http://dbpedia.org/resource/America's_Sweethearts>, <http://dbpedia.org/resource/Sleeping_with_the_Enemy>, <http://dbpedia.org/resource/Michael_Collins_(film)>, <http://dbpedia.org/resource/Larry_Crowne>, <http://dbpedia.org/resource/Confessions_of_a_Dangerous_Mind>, <http://dbpedia.org/resource/Charlie_Wilson's_War>, <http://dbpedia.org/resource/Something_to_Talk_About_(film)>, <http://dbpedia.org/resource/Mona_Lisa_Smile>, <http://dbpedia.org/resource/Ocean's_Eleven>, <http://dbpedia.org/resource/The_Mexican>, <http://dbpedia.org/resource/Mary_Reilly_(film)>, <http://dbpedia.org/resource/Conspiracy_Theory_(film)>]"
35,┬┐En qu├® pa├¡s nace el Ganges?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Ganges dbo:sourceCountry ?uri .
}",[<http://dbpedia.org/resource/India>]
36,┬┐En que a├▒o naci├│ Rachel Stevens?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Rachel_Stevens> <http://dbpedia.org/ontology/birthYear> ?uri . } ,"[""1978""^^xsd:gYear]"
37,┬┐Es Barack Obama dem├│crata?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE { 
        res:Barack_Obama dbo:party <http://dbpedia.org/resource/Democratic_Party_(United_States)> . 
}",[true]
38,┬┐D├│nde naci├│ Bach?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Johann_Sebastian_Bach dbo:birthPlace ?uri .
}",[<http://dbpedia.org/resource/Eisenach>]
39,┬┐Cu├íntas veces ha estado casada Jane Fonda?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Jane_Fonda> <http://dbpedia.org/ontology/spouse> ?uri . } ,[3]
40,┬┐Qui├®n fue el primero en ascender al Monte Everest?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
          res:Mount_Everest dbo:firstAscentPerson ?uri . 
}","[<http://dbpedia.org/resource/Edmund_Hillary>, <http://dbpedia.org/resource/Krzysztof_Wielicki>, <http://dbpedia.org/resource/Leszek_Cichy>, <http://dbpedia.org/resource/Tenzing_Norgay>]"
41,┬┐Cu├íntas personas viven en Polonia?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Poland> <http://dbpedia.org/ontology/populationTotal> ?uri . }  ,"[""38186860""^^xsd:nonNegativeInteger]"
42,┬┐Donde est├ín situadas las Casas del Parlamento?,SELECT ?uri WHERE {  <http://dbpedia.org/resource/Palace_of_Westminster> <http://dbpedia.org/ontology/location> ?uri . } ,"[<http://dbpedia.org/resource/City_of_Westminster>, <http://dbpedia.org/resource/England>, <http://dbpedia.org/resource/Greater_London>]"
43,┬┐Act├║a Christian Bale en Batman Begins?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	res:Batman_Begins dbo:starring res:Christian_Bale .
}",[true]
44,┬┐En qu├® pa├¡s se encuentra el lago Limerick?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
	res:Limerick_Lake dbo:country ?uri .
}",[<http://dbpedia.org/resource/Canada>]
45,┬┐Cu├íl fue la ├║ltima pel├¡cula con Alec Guinness?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Alec_Guinness> .  ?uri <http://dbpedia.org/ontology/releaseDate> ?date . } ORDER BY DESC(?date) LIMIT 1 ,[<http://dbpedia.org/resource/Kafka_(film)>]
46,┬┐Cu├íl es la monta├▒a m├ís alta de Australia?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type dbo:Mountain .
        ?uri dbo:locatedInArea res:Australia .
        ?uri dbo:elevation ?elevation .
} 
ORDER BY DESC(?elevation) LIMIT 1",[<http://dbpedia.org/resource/Mawson_Peak>]
47,┬┐Todav├¡a vive Frank Herbert?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	OPTIONAL { res:Frank_Herbert dbo:deathDate ?date . }
        FILTER (!BOUND(?date))
}",[true]
48,┬┐Qui├®n cre├│ Family Guy?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Family_Guy> <http://dbpedia.org/ontology/creator> ?uri . }  ,[<http://dbpedia.org/resource/Seth_MacFarlane>]
49,┬┐Cu├íl es la idioma oficial de Surinam?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Suriname dbo:officialLanguage ?uri .
}",[<http://dbpedia.org/resource/Dutch_language>]
50,┬┐Qui├®n escribi├│ la canci├│n Hotel California?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hotel_California> <http://dbpedia.org/ontology/writer> ?uri . },"[<http://dbpedia.org/resource/Don_Felder>, <http://dbpedia.org/resource/Don_Henley>, <http://dbpedia.org/resource/Glenn_Frey>]"
51,Dame todos los actores de pel├¡culas dirigidas por William Shatner.,SELECT DISTINCT ?uri WHERE {  ?x <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner> .  ?x <http://dbpedia.org/ontology/starring> ?uri . } ,"[<http://dbpedia.org/resource/DeForest_Kelley>, <http://dbpedia.org/resource/George_Takei>, <http://dbpedia.org/resource/James_Doohan>, <http://dbpedia.org/resource/Leonard_Nimoy>, <http://dbpedia.org/resource/Nichelle_Nichols>, <http://dbpedia.org/resource/Walter_Koenig>, <http://dbpedia.org/resource/Dan_Martin_(actor)>, <http://dbpedia.org/resource/William_Shatner>, <http://dbpedia.org/resource/Tom_Towles>, <http://dbpedia.org/resource/Chuck_Williams_(actor)>, <http://dbpedia.org/resource/Amy_Acker>, <http://dbpedia.org/resource/Duane_Whitaker>, <http://dbpedia.org/resource/John_Prosky>, <http://dbpedia.org/resource/Dan_Gauthier>, <http://dbpedia.org/resource/J.T._Colosa>, <http://dbpedia.org/resource/Dick_Van_Patten>, <http://dbpedia.org/resource/Brenda_Bakke>, <http://dbpedia.org/resource/Rickey_Medlocke>]"
52,┬┐Qu├® contiene una galleta de chocolate?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chocolate_chip_cookie> <http://dbpedia.org/ontology/ingredient> ?uri . },"[<http://dbpedia.org/resource/Chocolate_chip>, <http://dbpedia.org/resource/Vanilla>, <http://dbpedia.org/resource/Sodium_bicarbonate>, <http://dbpedia.org/resource/Egg_(food)>, <http://dbpedia.org/resource/Brown_sugar>, <http://dbpedia.org/resource/Salt>, <http://dbpedia.org/resource/Butter>, <http://dbpedia.org/resource/Shortening>, <http://dbpedia.org/resource/Sugar>, <http://dbpedia.org/resource/Flour>]"
53,Dame todos las skateboarders profesionales de Suecia.,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	?uri dbo:occupation res:Skateboarding . 
        { ?uri dbo:birthPlace res:Sweden . }
        UNION
        { ?uri dbo:birthPlace ?place . 
          ?place dbo:country res:Sweden . }
}",[<http://dbpedia.org/resource/Ali_Boulala>]
54,┬┐Qu├® ingredientes son necesarios para una tarta de zanahorias?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Carrot_cake> <http://dbpedia.org/ontology/ingredient> ?uri . } ,"[<http://dbpedia.org/resource/Allspice>, <http://dbpedia.org/resource/Carrot>, <http://dbpedia.org/resource/Cream_cheese>, <http://dbpedia.org/resource/Egg_(food)>, <http://dbpedia.org/resource/Flour>, <http://dbpedia.org/resource/Icing_(food)>, <http://dbpedia.org/resource/Marzipan>, <http://dbpedia.org/resource/Nutmeg>, <http://dbpedia.org/resource/Sugar>]"
55,┬┐juega Neymar en el Real Madrid?,ASK WHERE { <http://dbpedia.org/resource/Neymar> <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Real_Madrid_C.F.> . },[false]
56,┬┐Qu├® ingeniero inform├ítico gan├│ un Oscar?,"SELECT DISTINCT ?uri WHERE { { ?uri <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Computer_science> . } UNION { ?uri <http://purl.org/dc/elements/1.1/description> ?s . FILTER regex(?s,'computer scientist','i') } ?uri <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Academy_Awards> . } ",[<http://dbpedia.org/resource/Edwin_Catmull>]
57,┬┐Cu├íntas compa├▒├¡as fueron fundadas en el mismo a├▒o que Google?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company> .  ?uri <http://dbpedia.org/ontology/foundingYear> ?year .  <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/foundingYear> ?year . } ,[0]
58,┬┐En qu├® ciudad del reino unido se encuentra el cuartel genetal del MI6?,"PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        res:Secret_Intelligence_Service dbo:headquarter ?uri . 
        ?uri dbo:country res:United_Kingdom . 
}",[<http://dbpedia.org/resource/London>]
59,┬┐Fu├® la crisis de cuba antes de la invasi├│n de bah├¡a de cochinos?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:Cuban_Missile_Crisis dbo:date ?x .
	res:Bay_of_Pigs_Invasion dbo:date ?y .
	FILTER (?x < ?y)
}",[true]
60,┬┐Qu├® abrevia IYCM?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:abbreviation 'IYCM' .
}",[<http://dbpedia.org/resource/Youth_Climate_Movement>]
61,┬┐Cu├índo se disolvi├│ la dinast├¡a de Ming?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?date
WHERE {  
        res:Ming_dynasty dbo:dissolutionDate ?date .
}","[""1644-04-25""^^xsd:date]"
62,Dame todos los episodios de la pr├¡mera ├®poca de la serie de HBO Los Sporanos.,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	?uri dbo:series res:The_Sopranos  .
        ?uri dbo:seasonNumber 1 .
}","[<http://dbpedia.org/resource/He_Is_Risen_(The_Sopranos)>, <http://dbpedia.org/resource/Everybody_Hurts_(The_Sopranos)>, http://dbpedia.org/resource/Proshai, <http://dbpedia.org/resource/Two_Tonys>, <http://dbpedia.org/resource/The_Blue_Comet>, <http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano>, <http://dbpedia.org/resource/Where's_Johnny%3F>, <http://dbpedia.org/resource/Stage_5_(The_Sopranos)>, <http://dbpedia.org/resource/Mergers_and_Acquisitions_(The_Sopranos)>, <http://dbpedia.org/resource/Eloise_(The_Sopranos)>, <http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti>, <http://dbpedia.org/resource/Johnny_Cakes_(The_Sopranos)>, <http://dbpedia.org/resource/46_Long>, <http://dbpedia.org/resource/The_Second_Coming_(The_Sopranos)>, <http://dbpedia.org/resource/Big_Girls_Don't_Cry_(The_Sopranos)>, <http://dbpedia.org/resource/Moe_n'_Joe>, http://dbpedia.org/resource/The_Strong, <http://dbpedia.org/resource/Irregular_Around_the_Margins>, <http://dbpedia.org/resource/Toodle_Fucking-Oo>, <http://dbpedia.org/resource/The_Happy_Wanderer_(The_Sopranos)>, <http://dbpedia.org/resource/House_Arrest_(The_Sopranos)>, <http://dbpedia.org/resource/Unidentified_Black_Males>, <http://dbpedia.org/resource/Guy_Walks_into_a_Psychiatrist's_Office...>, <http://dbpedia.org/resource/No_Show>, <http://dbpedia.org/resource/Isabella_(The_Sopranos)>, <http://dbpedia.org/resource/Watching_Too_Much_Television>, <http://dbpedia.org/resource/Mr._Ruggerio's_Neighborhood>, <http://dbpedia.org/resource/Pax_Soprana>, <http://dbpedia.org/resource/Whoever_Did_This>, <http://dbpedia.org/resource/Army_of_One_(The_Sopranos)>, <http://dbpedia.org/resource/Another_Toothpick>, <http://dbpedia.org/resource/The_Weight_(The_Sopranos)>, <http://dbpedia.org/resource/Amour_Fou>, <http://dbpedia.org/resource/Pine_Barrens_(The_Sopranos)>, <http://dbpedia.org/resource/University_(The_Sopranos)>, <http://dbpedia.org/resource/Remember_When_(The_Sopranos)>, <http://dbpedia.org/resource/...To_Save_Us_All_from_Satan's_Power>, <http://dbpedia.org/resource/Members_Only_(The_Sopranos)>, <http://dbpedia.org/resource/Second_Opinion_(The_Sopranos)>, <http://dbpedia.org/resource/Live_Free_or_Die_(The_Sopranos)>, <http://dbpedia.org/resource/Made_in_America_(The_Sopranos)>, <http://dbpedia.org/resource/Nobody_Knows_Anything>, <http://dbpedia.org/resource/Kennedy_and_Heidi>, <http://dbpedia.org/resource/D-Girl_(The_Sopranos)>, <http://dbpedia.org/resource/Employee_of_the_Month_(The_Sopranos)>, <http://dbpedia.org/resource/Cold_Stones>, <http://dbpedia.org/resource/All_Happy_Families...>, <http://dbpedia.org/resource/The_Ride_(The_Sopranos)>, <http://dbpedia.org/resource/Soprano_Home_Movies>, <http://dbpedia.org/resource/Do_Not_Resuscitate_(The_Sopranos)>, <http://dbpedia.org/resource/Commendatori>, <http://dbpedia.org/resource/All_Due_Respect_(The_Sopranos)>, <http://dbpedia.org/resource/A_Hit_Is_a_Hit>, <http://dbpedia.org/resource/Boca_(The_Sopranos)>, <http://dbpedia.org/resource/Calling_All_Cars_(The_Sopranos)>, <http://dbpedia.org/resource/For_All_Debts_Public_and_Private>, <http://dbpedia.org/resource/Kaisha>, <http://dbpedia.org/resource/College_(The_Sopranos)>, <http://dbpedia.org/resource/The_Knight_in_White_Satin_Armor>, http://dbpedia.org/resource/Denial, <http://dbpedia.org/resource/Christopher_(The_Sopranos)>, <http://dbpedia.org/resource/The_Telltale_Moozadell>, <http://dbpedia.org/resource/Cold_Cuts_(The_Sopranos)>, <http://dbpedia.org/resource/Down_Neck>, <http://dbpedia.org/resource/Long_Term_Parking>, <http://dbpedia.org/resource/Pie-O-My>, <http://dbpedia.org/resource/Join_the_Club>, <http://dbpedia.org/resource/From_Where_to_Eternity>, <http://dbpedia.org/resource/Mayham>, <http://dbpedia.org/resource/Whitecaps_(The_Sopranos)>, <http://dbpedia.org/resource/The_Fleshy_Part_of_the_Thigh>, <http://dbpedia.org/resource/Rat_Pack_(The_Sopranos)>, <http://dbpedia.org/resource/Full_Leather_Jacket>, <http://dbpedia.org/resource/Mr._&_Mrs._John_Sacrimoni_Request...>, <http://dbpedia.org/resource/The_Test_Dream>, <http://dbpedia.org/resource/Bust_Out>, <http://dbpedia.org/resource/Walk_Like_a_Man_(The_Sopranos)>, <http://dbpedia.org/resource/Sentimental_Education_(The_Sopranos)>, <http://dbpedia.org/resource/Funhouse_(The_Sopranos)>, <http://dbpedia.org/resource/Chasing_It>, <http://dbpedia.org/resource/Meadowlands_(The_Sopranos)>, <http://dbpedia.org/resource/In_Camelot>, <http://dbpedia.org/resource/Fortunate_Son_(The_Sopranos)>, <http://dbpedia.org/resource/Marco_Polo_(The_Sopranos)>, <http://dbpedia.org/resource/Luxury_Lounge>, <http://dbpedia.org/resource/The_Sopranos_(episode)>]"
63,"┬┐Cu├íl es la poblaci├│n total de Melbourne, Florida?","PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT ?uri 
WHERE { 
        <http://dbpedia.org/resource/Melbourne,_Florida> dbo:populationTotal ?uri .
}","[""76068""^^xsd:nonNegativeInteger]"
64,┬┐Fue Arnold Schwarzenegger a la universidad?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK
WHERE {
        res:Arnold_Schwarzenegger dbo:almaMater ?x .
        ?x rdf:type dbo:University .
}",[true]
65,┬┐En que pa├¡s esta el monte Everest?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        res:Mount_Everest dbo:locatedInArea ?uri . 
        ?uri rdf:type dbo:Country .
}","[<http://dbpedia.org/resource/China>, <http://dbpedia.org/resource/Nepal>, <http://dbpedia.org/resource/Sagarmatha_Zone>, <http://dbpedia.org/resource/Shigatse_Prefecture>, <http://dbpedia.org/resource/Solukhumbu_District>, <http://dbpedia.org/resource/Tibet_Autonomous_Region>, <http://dbpedia.org/resource/Tingri_County>]"
66,┬┐Cu├íl es la cuidad m├ís grande de Australia?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:Australia dbo:largestCity ?uri .
}",[<http://dbpedia.org/resource/Sydney>]
67,Dame todas las plataformas de lanzamiento operadas por la NASA.,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:LaunchPad .  
        ?uri dbo:operator res:NASA . 
}","[<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39>, <http://dbpedia.org/resource/MV_Retriever>, <http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13>, <http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36>, <http://dbpedia.org/resource/White_Sands_Space_Harbor>, <http://dbpedia.org/resource/Broglio_Space_Centre>, <http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0>, <http://dbpedia.org/resource/Keweenaw_Rocket_Range>, <http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3>]"
68,┬┐Qui├®n es el alcalde de Tel Aviv?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Tel_Aviv dbo:leaderName ?uri .
}",[<http://dbpedia.org/resource/Ron_Huldai>]
70,┬┐Qui├®n cre├│ Batman?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } ,"[<http://dbpedia.org/resource/Bill_Finger>, <http://dbpedia.org/resource/Bob_Kane>]"
71,┬┐Qui├®n interpreto a Gus Fring en Breaking Bad?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gus_Fring> <http://dbpedia.org/ontology/portrayer> ?uri . },[<http://dbpedia.org/resource/Giancarlo_Esposito>]
72,┬┐En qu├® lenguaje de programaci├│n esta programado GIMP?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
	res:GIMP dbo:programmingLanguage ?uri .
}","[<http://dbpedia.org/resource/C_(programming_language)>, <http://dbpedia.org/resource/GTK+>]"
73,En que imperio antiguo pagar├¡a con granos de cacao?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Cocoa_bean> . },[<http://dbpedia.org/resource/Aztec_Empire>]
74,┬┐Qui├®n es el editor de Forbes?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Forbes dbo:editor ?uri .
}",[<http://dbpedia.org/resource/Steve_Forbes>]
75,┬┐Cu├ínta gente vive en la capital de Australia?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
        res:Australia dbo:capital ?x .
        ?x dbo:populationTotal ?num .
}","[""381488""^^xsd:nonNegativeInteger]"
76,┬┐Qu├® surfistas profesionales nacieron en Australia?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Surfing .  
        ?uri dbo:birthPlace res:Australia . 
}","[<http://dbpedia.org/resource/Kevin_Volchok>, <http://dbpedia.org/resource/Mark_Morgan_(composer)>, <http://dbpedia.org/resource/Midget_Farrelly>, <http://dbpedia.org/resource/Doc_Paskowitz>, <http://dbpedia.org/resource/Marcus_Adoro>, <http://dbpedia.org/resource/Peggy_Oki>, <http://dbpedia.org/resource/Cheyne_Magnusson>, <http://dbpedia.org/resource/Johnny_Harper>, <http://dbpedia.org/resource/Simon_Anderson>, <http://dbpedia.org/resource/James_Lovett>, <http://dbpedia.org/resource/Koby_Abberton>, <http://dbpedia.org/resource/Daize_Shayne>, <http://dbpedia.org/resource/Ian_Cairns>, <http://dbpedia.org/resource/Kit_Horn>]"
