id,question,sparql,answer
161,┬┐Que tipo de uva crece en Oregon?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Oregon_wine> <http://dbpedia.org/ontology/growingGrape> ?uri . } ,"[<http://dbpedia.org/resource/Barbera>, <http://dbpedia.org/resource/Gew%C3%BCrztraminer>, <http://dbpedia.org/resource/Black_Muscat>, <http://dbpedia.org/resource/M%C3%BCller-Thurgau>, <http://dbpedia.org/resource/Riesling>, <http://dbpedia.org/resource/Merlot>, <http://dbpedia.org/resource/Chenin_blanc>, <http://dbpedia.org/resource/Malbec>, <http://dbpedia.org/resource/Pinot_Meunier>, <http://dbpedia.org/resource/Grenache>, <http://dbpedia.org/resource/Chardonnay>, <http://dbpedia.org/resource/Melon>, <http://dbpedia.org/resource/Pinot_noir>, <http://dbpedia.org/resource/Syrah>, <http://dbpedia.org/resource/Huxelrebe>, <http://dbpedia.org/resource/Cabernet_Sauvignon>, <http://dbpedia.org/resource/Sangiovese>, <http://dbpedia.org/resource/Dolcetto>, <http://dbpedia.org/resource/Pinot_gris>, <http://dbpedia.org/resource/Sauvignon_blanc>, <http://dbpedia.org/resource/Cabernet_Franc>, <http://dbpedia.org/resource/Muscat_Blanc_%C3%A0_Petits_Grains>, <http://dbpedia.org/resource/Marechal_Foch>, <http://dbpedia.org/resource/Pinot_blanc>, <http://dbpedia.org/resource/Scheurebe>, <http://dbpedia.org/resource/Baco_noir>, <http://dbpedia.org/resource/L%C3%A9on_Millot>, <http://dbpedia.org/resource/Muscat_(grape)>, <http://dbpedia.org/resource/Carmine>, <http://dbpedia.org/resource/S%C3%A9millon>, <http://dbpedia.org/resource/Viognier>, <http://dbpedia.org/resource/Gamay>, <http://dbpedia.org/resource/Zinfandel>, <http://dbpedia.org/resource/Petit_Verdot>]"
162,┬┐Qu├® altura tiene Michael Jordan?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
        res:Michael_Jordan dbo:height ?num .
}","[""1.9812""^^xsd:double]"
163,┬┐A qu├® partido politico pertenece el alcalde de Par├¡s?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paris> <http://dbpedia.org/ontology/mayor> ?x . ?x <http://dbpedia.org/ontology/party> ?uri . },[<http://dbpedia.org/resource/Socialist_Party_(France)>]
164,┬┐Quen escribi├│ el libro Los pilares de la Tierra?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:The_Pillars_of_the_Earth dbo:author ?uri .
}",[<http://dbpedia.org/resource/Ken_Follett>]
165,┬┐Qui├®n fue el 16th presidente de los Estados Unidos?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
         ?uri dbo:office 'President of the United States' .
         ?uri dbo:orderInOffice '16th' .
}","[<http://dbpedia.org/resource/%C5%A0imun_de_Michieli-Vitturi>, <http://dbpedia.org/resource/A._H._G._Dawson>]"
166,┬┐Qu├® alto es el Monte Everest?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
	res:Mount_Everest dbo:elevation ?num.
}","[""8848.0""^^xsd:double]"
167,┬┐Quien es el supervisor de doctorado de Albert Einstein?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Albert_Einstein> <http://dbpedia.org/ontology/doctoralAdvisor> ?uri . },[<http://dbpedia.org/resource/Alfred_Kleiner>]
168,┬┐En qu├® ciudad vive Sylvester Stallone?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/City> . <http://dbpedia.org/resource/Sylvester_Stallone> <http://dbpedia.org/ontology/residence> ?uri . },"[http://dbpedia.org/resource/Beverly_Hills, <http://dbpedia.org/resource/California>]"
169,┬┐Cu├íl es la moneda de la rep├║blica checa?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	res:Czech_Republic dbo:currency ?uri .
}",[<http://dbpedia.org/resource/Czech_koruna>]
170,┬┐Tuvo S├│crates influencia sobre Arist├│teles?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	res:Aristotle dbo:influencedBy res:Socrates .
}",[true]
171,┬┐En qu├® zona horaria se encuentra Salt Lake City?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
	res:Salt_Lake_City dbp:timezone ?uri . 
}",[<http://dbpedia.org/resource/Mountain_Time_Zone>]
172,┬┐Qui├®n es el hijo de Sonny y Cher?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Cher> . ?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Sonny_Bono> . },[<http://dbpedia.org/resource/Chaz_Bono>]
173,┬┐En qu├® ciudad se encuentra la sede de las Naciones Unidas?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Headquarters_of_the_United_Nations> <http://dbpedia.org/ontology/location> ?uri . ?uri a <http://dbpedia.org/ontology/City> . } ,[<http://dbpedia.org/resource/New_York_City>]
174,┬┐Quien es el fundador de Penguin Books?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        res:Penguin_Books dbo:founder ?uri .
}",[<http://dbpedia.org/resource/Allen_Lane>]
175,┬┐C├║ando se fund├│ Jack Wolfskin?,SELECT DISTINCT ?year WHERE {  <http://dbpedia.org/resource/Jack_Wolfskin> <http://dbpedia.org/ontology/foundingYear> ?year . } ,"[""1981""^^xsd:gYear]"
176,┬┐Qui├®n es el alcalde de Rotterdam?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Rotterdam dbo:leaderName ?uri .
}",[<http://dbpedia.org/resource/Ahmed_Aboutaleb>]
179,┬┐Qui├®n son los padres de la esposa de Juan Carlos I?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Juan_Carlos_I_of_Spain dbo:spouse ?x . 
        ?x dbo:parent ?uri . 
}","[<http://dbpedia.org/resource/Frederica_of_Hanover>, <http://dbpedia.org/resource/Paul_of_Greece>]"
180,┬┐Obtuvo Tesla el premio nobel de f├¡sica?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:Nikola_Tesla dbo:award res:Nobel_Prize_in_Physics .
}",[true]
181,Quien es el jugador de baloncesto mas alto?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer> .  ?uri <http://dbpedia.org/ontology/height> ?num . } ORDER BY DESC(?num) OFFSET 0 LIMIT 1 ,[<http://dbpedia.org/resource/Thijs_Vermeulen>]
182,┬┐Que ciudad tiene la menor poblaci├│n?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City> .  ?uri <http://dbpedia.org/ontology/populationTotal> ?pop . } ORDER BY ASC(?pop) OFFSET 0 LIMIT 1 ,"[<http://dbpedia.org/resource/Greenhorn,_Oregon>]"
183,┬┐La proinsulina es una proteina?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
	res:Proinsulin rdf:type dbo:Protein .
}",[true]
184,┬┐Qui├®nes fueron los padres de la reina Victoria?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
         res:Queen_Victoria dbo:parent ?uri .
}","[http://dbpedia.org/resource/Prince_Edward, <http://dbpedia.org/resource/Princess_Victoria_of_Saxe-Coburg-Saalfeld>]"
185,┬┐Tuvo hijos el Che Guevara?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE { 
        res:Che_Guevara dbo:child ?uri . 
}",[true]
186,┬┐Es el lago Baikal mayor que el lago Great Bear?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
ASK
WHERE {  
        res:Lake_Baikal dbo:areaTotal ?a1 . 
        res:Great_Bear_Lake dbo:areaTotal ?a2 .
        FILTER (?a1 > ?a2)
}",[true]
187,┬┐Gano Kaurism├ñki alguna vez el Gran Prix de Cannes?,ASK WHERE { <http://dbpedia.org/resource/Aki_Kaurismäki> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Grand_Prix_(Cannes_Film_Festival)> . },[true]
189,┬┐Donde se encuentra el Fort Knox?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Fort_Knox> <http://dbpedia.org/property/location> ?uri . },[<http://dbpedia.org/resource/Kentucky>]
190,┬┐En qu├® estado american se encuentra Fort Knox?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	res:Fort_Knox dbp:location ?uri .
        ?uri dbo:country res:United_States .
}",[<http://dbpedia.org/resource/Kentucky>]
191,┬┐D├│nde est├í enterrado Syngman Rhee?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Syngman_Rhee> <http://dbpedia.org/ontology/restingPlace> ?uri . } ,[<http://dbpedia.org/resource/Time_in_Chile>]
192,┬┐Cu├íl es la zona horaria en San Pedro de Atacama?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/San_Pedro_de_Atacama> <http://dbpedia.org/ontology/timeZone> ?uri . } ,[<http://dbpedia.org/resource/Time_in_Chile>]
193,┬┐A qu├® estilo art├¡stico pertenece el pinto de Los Tres Bailarines?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Three_Dancers> <http://dbpedia.org/ontology/author> ?person .  ?person <http://dbpedia.org/ontology/movement> ?uri . } ,[<http://dbpedia.org/resource/Cubism>]
195,Mu├®strame todos los libros en la serie Fundaci├│n de Asimov,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series> . } ,[<http://dbpedia.org/resource/Foundation's_Edge>]
196,Dame todas las cuidades en New Jersey que tengan m├ís de 100000 habitantes.,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri  WHERE {?uri rdf:type dbo:City .        ?uri dbo:isPartOf res:New_Jersey .        ?uri dbp:populationTotal ?inhabitants .        FILTER (?inhabitants > 100000) .},"[<http://dbpedia.org/resource/Newark,_New_Jersey>,<http://dbpedia.org/resource/Jersey_City,_New_Jersey>,<http://dbpedia.org/resource/Elizabeth,_New_Jersey>,<http://dbpedia.org/resource/Paterson,_New_Jersey>]"
197,┬┐Qu├® museo en Nueva York tiene el mayor numero de visitantes?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Museum> .  ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/New_York_City> .  ?uri <http://dbpedia.org/ontology/numberOfVisitors> ?num . } ORDER BY DESC(?num) OFFSET 0 LIMIT 1 ,[<http://dbpedia.org/resource/Museum_of_Motherhood>]
198,┬┐C├│mo de alta el la torre Yokohama Marine?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num
WHERE {
        res:Yokohama_Marine_Tower dbo:height ?num .
}","[""106.0704""^^xsd:double]"
200,┬┐Qui├®n es el jugador mas j├│ven de dardos?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:DartsPlayer .
        ?uri dbo:birthDate ?date .
}
ORDER BY DESC(?date)
OFFSET 0 LIMIT 1",[<http://dbpedia.org/resource/Max_Hopp>]
201,┬┐Qui├®n desarroll├│ el videojuego Warcraft?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:World_of_Warcraft dbo:developer ?uri . 
}",[<http://dbpedia.org/resource/Blizzard_Entertainment>]
202,┬┐Quien fue el papa que fundo la televisi├│n Vaticana?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT ?uri 
WHERE { 
         ?uri rdf:type dbo:Pope . 
         res:Vatican_Television_Center dbo:foundedBy ?uri .
}",[<http://dbpedia.org/resource/Pope_John_Paul_II>]
203,┬┐Qui├®n compuso la m├║sica para Harold y Maude?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
	res:Harold_and_Maude dbo:musicComposer ?uri .
}",[<http://dbpedia.org/resource/Cat_Stevens>]
204,Dame todos los miembros de la banda Prodigy.,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?uri . } ,"[<http://dbpedia.org/resource/Keith_Flint>, <http://dbpedia.org/resource/Liam_Howlett>, <http://dbpedia.org/resource/Maxim_Reality>]"
206,┬┐Qu├® subsidiario de TUI Travel vuela en Glasgow y en Dublin?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/TUI_Travel> <http://dbpedia.org/ontology/subsidiary> ?uri .  ?uri <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Glasgow_Airport> . ?uri <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Dublin_Airport> . } ,"[<http://dbpedia.org/resource/Thomson_Airways>, <http://dbpedia.org/resource/Thomson_Holidays>]"
207,┬┐En que pa├¡s se sit├║a la Meca?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri 
WHERE {  
        res:Mecca dbo:country ?uri .
}",[<http://dbpedia.org/resource/Saudi_Arabia]
208,┬┐Cu├íntos idiomas se hablan en Colombia?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Language> .  <http://dbpedia.org/resource/Colombia> <http://dbpedia.org/ontology/language> ?uri . } ,[2]
209,┬┐Cu├íl es el estadio m├ís grande de Espa├▒a?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Stadium> . ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Spain> . ?uri <http://dbpedia.org/ontology/seatingCapacity> ?n . } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,[<http://dbpedia.org/resource/Camp_Nou>]
210,┬┐Qu├® surfistas profesionales nacieron en las Filipinas?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	?uri dbo:occupation res:Surfing .
	?uri dbo:birthPlace res:Philippines .
}","[<http://dbpedia.org/resource/Kevin_Volchok>, <http://dbpedia.org/resource/Mark_Morgan_(composer)>, <http://dbpedia.org/resource/Midget_Farrelly>, <http://dbpedia.org/resource/Doc_Paskowitz>, <http://dbpedia.org/resource/Marcus_Adoro>, <http://dbpedia.org/resource/Peggy_Oki>, <http://dbpedia.org/resource/Cheyne_Magnusson>, <http://dbpedia.org/resource/Johnny_Harper>, <http://dbpedia.org/resource/Simon_Anderson>, <http://dbpedia.org/resource/James_Lovett>, <http://dbpedia.org/resource/Koby_Abberton>, <http://dbpedia.org/resource/Daize_Shayne>, <http://dbpedia.org/resource/Ian_Cairns>, <http://dbpedia.org/resource/Kit_Horn>]"
211,┬┐Cu├íles son los cinco condados de Nueva York?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/governmentType> <http://dbpedia.org/resource/Borough_(New_York_City)> . },"[<http://dbpedia.org/resource/The_Bronx>, <http://dbpedia.org/resource/Brooklyn>, <http://dbpedia.org/resource/Queens>, <http://dbpedia.org/resource/Staten_Island>, <http://dbpedia.org/resource/Manhattan>]"
212,┬┐La Coca Cola es una bebida?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
        res:Cola rdf:type dbo:Beverage .
}",[true]
213,¿Cuándo murió la princesa Diana?,"SELECT DISTINCT ?d WHERE { <http://dbpedia.org/resource/Diana,_Princess_of_Wales> <http://dbpedia.org/ontology/deathDate> ?d . }","[""1997-08-31""^^xsd:date]"
214,¿Dónde en Francia se produce el vino espumoso?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:wineProduced res:Sparkling_wine .
        ?uri dbo:location res:France .
}","[<http://dbpedia.org/resource/Tasmanian_wine>, <http://dbpedia.org/resource/Wahluke_Slope_AVA>, <http://dbpedia.org/resource/Columbia_Valley_AVA>, <http://dbpedia.org/resource/Yakima_Valley_AVA>, <http://dbpedia.org/resource/Puget_Sound_AVA>, <http://dbpedia.org/resource/Horse_Heaven_Hills_AVA>, <http://dbpedia.org/resource/Loire_Valley_(wine)>, <http://dbpedia.org/resource/Walla_Walla_Valley_AVA>]"