"QALD id","match status","QALD question","QueGG question","QALD SPARQL query","QueGG SPARQL query"
"1","0.5454545454545454","List all the musicals with music by Elton John.","""List all the musics by Elton John""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uriWHERE {         ?uri rdf:type dbo:Musical .        ?uri dbo:musicBy res:Elton_John .}","""select  ?s    {   ?s <http://dbpedia.org/ontology/musicBy>  <http://dbpedia.org/resource/Elton_John> .    }"""
"70","1.0","Who created Batman?","""Who created Batman?""","SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } ","""select  ?o    {    <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator>  ?o .    }"""
"78","0.8333333333333334","Give me all video games published by Mean Hamster Software.","""Give me all video games published by Mean Hamster Software?""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE {      ?uri rdf:type dbo:VideoGame .      ?uri dbo:publisher res:Mean_Hamster_Software . }","""select  ?s    {   ?s <http://dbpedia.org/ontology/publisher>  <http://dbpedia.org/resource/Mean_Hamster_Software> .    }"""
"83","0.6666666666666666","Give me all movies directed by Francis Ford Coppola.","""Give me all films directed by Francis Ford Coppola?""","SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Francis_Ford_Coppola> . } ","""select  ?s    {   ?s <http://dbpedia.org/ontology/director>  <http://dbpedia.org/resource/Francis_Ford_Coppola> .   ?s <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>  <http://dbpedia.org/ontology/Film> .    }"""
"95","0.6666666666666666","Give me all Canadian Grunge record labels.","""Give me all record labels of Grunge""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE {	?uri rdf:type dbo:RecordLabel .        ?uri dbo:genre res:Grunge .        ?uri dbo:country res:Canada .}","""select  ?o    {    <http://dbpedia.org/resource/Grunge> <http://dbpedia.org/ontology/RecordLabel>  ?o .    }"""
"97","0.75","List the children of Margaret Thatcher.","""List all the children of Margaret Thatcher""","PREFIX res: <http://dbpedia.org/resource/>PREFIX dbo: <http://dbpedia.org/ontology/>SELECT DISTINCT ?uri WHERE {	res:Margaret_Thatcher dbo:child ?uri .}","""select  ?o    {    <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child>  ?o .    }"""
"102","0.7142857142857143","List all games by GMT.","""List all the games by GMT Games""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uri WHERE {	        ?uri dbo:publisher res:GMT_Games .}","""select  ?s    {   ?s <http://dbpedia.org/ontology/publisher>  <http://dbpedia.org/resource/GMT_Games> .    }"""
"146","0.5384615384615384","Give me all actors starring in Last Action Hero.","""Give me all persons starr in Last Action Hero?""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE {        res:Last_Action_Hero dbo:starring ?uri . }","""select  ?o    {    <http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring>  ?o .    }"""
"196","0.5384615384615384","Give me all cities in New Jersey with more than 100000 inhabitants.","""Give me all cities in New Jersey""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbp: <http://dbpedia.org/property/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE {	?uri rdf:type dbo:City .        ?uri dbo:isPartOf res:New_Jersey .        ?uri dbp:populationTotal ?inhabitants .        FILTER (?inhabitants > 100000) .}","""select  ?o    {    <http://dbpedia.org/resource/New_Jersey> <http://dbpedia.org/ontology/isPartOf>  ?o .    }"""
