"1","0.5454545454545454","List all the musicals with music by Elton John.","""List all the musics by Elton John""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uriWHERE {         ?uri rdf:type dbo:Musical .        ?uri dbo:musicBy res:Elton_John .}","""select  ?s    {   ?s <http://dbpedia.org/ontology/musicBy>  <http://dbpedia.org/resource/Elton_John> .    }""","[http://dbpedia.org/resource/Aida_musical, http://dbpedia.org/resource/The_Lion_King_musical, http://dbpedia.org/resource/Billy_Elliot_the_Musical, http://dbpedia.org/resource/Lestat_musical]","[(http://dbpedia.org/resource/The_Lion_King_(musical) ), (http://dbpedia.org/resource/Billy_Elliot_the_Musical ), (http://dbpedia.org/resource/Lestat_(musical) ), (http://dbpedia.org/resource/Aida_(musical) )]"
"70","1.0","Who created Batman?","""Who created Batman?""","SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } ","""select  ?o    {    <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator>  ?o .    }""","[http://dbpedia.org/resource/Bill_Finger, http://dbpedia.org/resource/Bob_Kane]","[(http://dbpedia.org/resource/Bill_Finger ), (http://dbpedia.org/resource/Bob_Kane )]"
"95","0.6666666666666666","Give me all Canadian Grunge record labels.","""Give me all record labels of Grunge""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE {	?uri rdf:type dbo:RecordLabel .        ?uri dbo:genre res:Grunge .        ?uri dbo:country res:Canada .}","""select  ?o    {    <http://dbpedia.org/resource/Grunge> <http://dbpedia.org/ontology/RecordLabel>  ?o .    }""","[http://dbpedia.org/resource/Murderecords]","[]"
"97","0.75","List the children of Margaret Thatcher.","""List all the children of Margaret Thatcher""","PREFIX res: <http://dbpedia.org/resource/>PREFIX dbo: <http://dbpedia.org/ontology/>SELECT DISTINCT ?uri WHERE {	res:Margaret_Thatcher dbo:child ?uri .}","""select  ?o    {    <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child>  ?o .    }""","[http://dbpedia.org/resource/Carol_Thatcher, http://dbpedia.org/resource/Mark_Thatcher]","[(http://dbpedia.org/resource/Carol_Thatcher ), (http://dbpedia.org/resource/Mark_Thatcher )]"
"102","0.7142857142857143","List all games by GMT.","""List all the games by GMT Games""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uri WHERE {	        ?uri dbo:publisher res:GMT_Games .}","""select  ?s    {   ?s <http://dbpedia.org/ontology/publisher>  <http://dbpedia.org/resource/GMT_Games> .    }""","[http://dbpedia.org/resource/Twilight_Struggle, http://dbpedia.org/resource/Washington's_War, http://dbpedia.org/resource/Chandragupta_board_game, http://dbpedia.org/resource/Paths_of_Glory_board_game, http://dbpedia.org/resource/Fields_of_Fire_game, http://dbpedia.org/resource/Sword_of_Rome, http://dbpedia.org/resource/Commands_&_Colors:_Ancients]","[(http://dbpedia.org/resource/Twilight_Struggle ), (http://dbpedia.org/resource/Washington's_War ), (http://dbpedia.org/resource/Chandragupta_(board_game) ), (http://dbpedia.org/resource/Paths_of_Glory_(board_game) ), (http://dbpedia.org/resource/Fields_of_Fire_(game) ), (http://dbpedia.org/resource/Sword_of_Rome ), (http://dbpedia.org/resource/Commands_&_Colors:_Ancients )]"
