"51","1.0","Give me all actors starring in movies directed by William Shatner.","""Give me all actors starring in movies directed by William Shatner.""","SELECT DISTINCT ?uri WHERE {  ?x <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner> .  ?x <http://dbpedia.org/ontology/starring> ?uri . } ","""SELECT DISTINCT ?o WHERE { ?s <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner> . ?s <http://dbpedia.org/ontology/starring> ?o . } ""","[http://dbpedia.org/resource/DeForest_Kelley, http://dbpedia.org/resource/George_Takei, http://dbpedia.org/resource/James_Doohan, http://dbpedia.org/resource/Leonard_Nimoy, http://dbpedia.org/resource/Nichelle_Nichols, http://dbpedia.org/resource/Walter_Koenig, http://dbpedia.org/resource/Dan_Martin_actor, http://dbpedia.org/resource/William_Shatner, http://dbpedia.org/resource/Tom_Towles, http://dbpedia.org/resource/Chuck_Williams_actor, http://dbpedia.org/resource/Amy_Acker, http://dbpedia.org/resource/Duane_Whitaker, http://dbpedia.org/resource/John_Prosky, http://dbpedia.org/resource/Dan_Gauthier, http://dbpedia.org/resource/J.T._Colosa, http://dbpedia.org/resource/Dick_Van_Patten, http://dbpedia.org/resource/Brenda_Bakke, http://dbpedia.org/resource/Rickey_Medlocke]","[(http://dbpedia.org/resource/DeForest_Kelley ), (http://dbpedia.org/resource/George_Takei ), (http://dbpedia.org/resource/James_Doohan ), (http://dbpedia.org/resource/Leonard_Nimoy ), (http://dbpedia.org/resource/Nichelle_Nichols ), (http://dbpedia.org/resource/Walter_Koenig ), (http://dbpedia.org/resource/Dan_Martin_(actor) ), (http://dbpedia.org/resource/William_Shatner ), (http://dbpedia.org/resource/Tom_Towles ), (http://dbpedia.org/resource/Chuck_Williams_(actor) ), (http://dbpedia.org/resource/Amy_Acker ), (http://dbpedia.org/resource/Duane_Whitaker ), (http://dbpedia.org/resource/John_Prosky ), (http://dbpedia.org/resource/Dan_Gauthier ), (http://dbpedia.org/resource/J.T._Colosa ), (http://dbpedia.org/resource/Dick_Van_Patten ), (http://dbpedia.org/resource/Brenda_Bakke ), (http://dbpedia.org/resource/Rickey_Medlocke )]"
"53","1.0","Give me all professional skateboarders from Sweden.","""Give me all professional skateboarders from Sweden.""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbp: <http://dbpedia.org/property/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uri WHERE {	?uri dbo:occupation res:Skateboarding .         { ?uri dbo:birthPlace res:Sweden . }        UNION        { ?uri dbo:birthPlace ?place .           ?place dbo:country res:Sweden . }}","""SELECT  ?s WHERE { ?s  <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Skateboarding> . ?s <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Sweden> . }""","[http://dbpedia.org/resource/Ali_Boulala, http://dbpedia.org/resource/Tony_Magnusson]","[(http://dbpedia.org/resource/Ray_Barbee ), (http://dbpedia.org/resource/Leo_Romero ), (http://dbpedia.org/resource/Eddie_Elguera ), (http://dbpedia.org/resource/Ali_Boulala ), (http://dbpedia.org/resource/Steve_Caballero ), (http://dbpedia.org/resource/Joe_Humeres ), (http://dbpedia.org/resource/Jason_Lee_(actor) ), (http://dbpedia.org/resource/Mike_McGill ), (http://dbpedia.org/resource/Bastien_Salabanzi ), (http://dbpedia.org/resource/Tony_Alva ), (http://dbpedia.org/resource/Duane_Peters ), (http://dbpedia.org/resource/Brian_Lotti ), (http://dbpedia.org/resource/Tony_Magnusson ), (http://dbpedia.org/resource/Peggy_Oki ), (http://dbpedia.org/resource/Jay_Adams ), (http://dbpedia.org/resource/Harold_Hunter ), (http://dbpedia.org/resource/Mario_Rubalcaba ), (http://dbpedia.org/resource/Mark_Appleyard ), (http://dbpedia.org/resource/Terry_Kennedy_(skateboarder) ), (http://dbpedia.org/resource/Stacy_Peralta ), (http://dbpedia.org/resource/PJ_Ladd ), (http://dbpedia.org/resource/Tim_Brauch ), (http://dbpedia.org/resource/Steve_Berra ), (http://dbpedia.org/resource/List_of_Zoey_101_characters ), (http://dbpedia.org/resource/Tommy_Guerrero ), (http://dbpedia.org/resource/Jereme_Rogers ), (http://dbpedia.org/resource/Justin_Pierce ), (http://dbpedia.org/resource/Jamie_Thomas ), (http://dbpedia.org/resource/Lee_Matasi ), (http://dbpedia.org/resource/Bob_Burnquist )]"
"67","1.0","Give me all launch pads operated by NASA.","""Give me all launch pads operated by NASA.""","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE {         ?uri rdf:type dbo:LaunchPad .          ?uri dbo:operator res:NASA . }","""SELECT DISTINCT ?s WHERE { ?s <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>. ?s <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>. } ""","[http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39, http://dbpedia.org/resource/MV_Retriever, http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13, http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36, http://dbpedia.org/resource/White_Sands_Space_Harbor, http://dbpedia.org/resource/Broglio_Space_Centre, http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0, http://dbpedia.org/resource/Keweenaw_Rocket_Range, http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3]","[(http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39 ), (http://dbpedia.org/resource/MV_Retriever ), (http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13 ), (http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36 ), (http://dbpedia.org/resource/White_Sands_Space_Harbor ), (http://dbpedia.org/resource/Broglio_Space_Centre ), (http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0 ), (http://dbpedia.org/resource/Keweenaw_Rocket_Range ), (http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3 )]"
"88","0.5454545454545454","Give me the grandchildren of Elvis Presley.","""Give me all parents of the parents of Elvis Presley?""","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?child . ?child <http://dbpedia.org/ontology/child> ?uri . }","""SELECT DISTINCT ?objOfProp WHERE {    ?subjOfProp <http://dbpedia.org/ontology/parent> ?objOfProp .   <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/parent> ?subjOfProp .}""","[http://dbpedia.org/resource/Riley_Keough]","[]"
"126","1.0","Give me the currency of China.","""Give me the currency of China.""","PREFIX res: <http://dbpedia.org/resource/>PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uriWHERE {     res:China dbo:currency ?uri . }","""SELECT DISTINCT ?o WHERE { <http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> ?o . }""","[http://dbpedia.org/resource/Renminbi]","[(http://dbpedia.org/resource/Renminbi )]"
"143","1.0","Show me the book that Muhammad Ali wrote.","""Show me the book that Muhammad Ali wrote.""","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE {          ?uri rdf:type dbo:Book .          ?uri dbo:author res:Muhammad_Ali . }","""SELECT DISTINCT ?s WHERE { ?s <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali>. }""","[http://dbpedia.org/resource/The_Soul_of_a_Butterfly]","[(http://dbpedia.org/resource/The_Soul_of_a_Butterfly )]"
"177","1.0","Give me all Swedish oceanographers.","""Give me all Swedish oceanographers.""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE {        ?uri dbo:field res:Oceanography .         ?uri dbo:birthPlace res:Sweden .        }","""SELECT DISTINCT ?subjOfProp WHERE { ?uri <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Oceanography> . ?subjOfProp dbo:birthPlace res:Sweden . }""","[http://dbpedia.org/resource/Tad_Murty, http://dbpedia.org/resource/Henry_Elderfield, http://dbpedia.org/resource/Bj%C3%B8rn_Helland-Hansen, http://dbpedia.org/resource/Stephen_E._Calvert, http://dbpedia.org/resource/Walter_Munk, http://dbpedia.org/resource/Maurice_Ewing, http://dbpedia.org/resource/Shailesh_Nayak, http://dbpedia.org/resource/Mar%C3%ADa_de_los_%C3%81ngeles_Alvari%C3%B1o_Gonz%C3%A1lez, http://dbpedia.org/resource/Josh_Willis, http://dbpedia.org/resource/Archibald_Gowanlock_Huntsman, http://dbpedia.org/resource/Lucien_Laubier, http://dbpedia.org/resource/Vagn_Walfrid_Ekman, http://dbpedia.org/resource/T._Wayland_Vaughan, http://dbpedia.org/resource/Joseph_Pedlosky, http://dbpedia.org/resource/Peter_Clift, http://dbpedia.org/resource/Alexandra_Worden, http://dbpedia.org/resource/Louis_Dangeard, http://dbpedia.org/resource/Stefan_Rahmstorf, http://dbpedia.org/resource/Felisa_Wolfe-Simon, http://dbpedia.org/resource/Archie_Carr, http://dbpedia.org/resource/Bruce_C._Heezen, http://dbpedia.org/resource/Alfred_C._Redfield, http://dbpedia.org/resource/Anny_Cazenave, http://dbpedia.org/resource/Marie_Tharp, http://dbpedia.org/resource/Robert_F._Dill, http://dbpedia.org/resource/Suzette_Kimball, http://dbpedia.org/resource/Sulochana_Gadgil, http://dbpedia.org/resource/Henryk_Arctowski, http://dbpedia.org/resource/Mojib_Latif, http://dbpedia.org/resource/Michael_Fasham, http://dbpedia.org/resource/Wies%C5%82aw_Mas%C5%82owski, http://dbpedia.org/resource/Jeffrey_C._Wynn, http://dbpedia.org/resource/Reuben_Lasker, http://dbpedia.org/resource/Alfred_Merz, http://dbpedia.org/resource/Harald_Sverdrup_oceanographer, http://dbpedia.org/resource/Peter_Huybers, http://dbpedia.org/resource/Sylvia_Earle, http://dbpedia.org/resource/Carl_Wunsch, http://dbpedia.org/resource/Nikolai_Mikhailovich_Knipovich, http://dbpedia.org/resource/Georg_W%C3%BCst, http://dbpedia.org/resource/Peter_A._Rona, http://dbpedia.org/resource/John_Imbrie]","[]"
"178","1.0","Show me Hemingway's autobiography.","""Show me Hemingway's autobiography.""","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Ernest_Hemingway> . ?uri <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Autobiography> . }","""SELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Ernest_Hemingway> }""","[http://dbpedia.org/resource/Death_in_the_Afternoon, http://dbpedia.org/resource/Green_Hills_of_Africa, http://dbpedia.org/resource/A_Farewell_to_Arms, http://dbpedia.org/resource/Islands_in_the_Stream_novel, http://dbpedia.org/resource/A_Clean, http://dbpedia.org/resource/The_Complete_Short_Stories_of_Ernest_Hemingway, http://dbpedia.org/resource/The_Fifth_Column_and_Four_Stories_of_the_Spanish_Civil_War, http://dbpedia.org/resource/To_Have_and_Have_Not, http://dbpedia.org/resource/A_Moveable_Feast, http://dbpedia.org/resource/The_Garden_of_Eden_novel, http://dbpedia.org/resource/Dateline:_Toronto, http://dbpedia.org/resource/In_Another_Country, http://dbpedia.org/resource/For_Whom_the_Bell_Tolls, http://dbpedia.org/resource/Che_Ti_Dice_La_Patria%3F, http://dbpedia.org/resource/The_Old_Man_and_the_Sea, http://dbpedia.org/resource/Now_I_Lay_Me, http://dbpedia.org/resource/The_Dangerous_Summer, http://dbpedia.org/resource/Hills_Like_White_Elephants, http://dbpedia.org/resource/The_Fifth_Column_and_the_First_Forty-Nine_Stories, http://dbpedia.org/resource/Across_the_River_and_into_the_Trees, http://dbpedia.org/resource/A_Day's_Wait]","[http://dbpedia.org/resource/Death_in_the_Afternoon, http://dbpedia.org/resource/Green_Hills_of_Africa, http://dbpedia.org/resource/A_Farewell_to_Arms, http://dbpedia.org/resource/Islands_in_the_Stream_novel, http://dbpedia.org/resource/A_Clean, http://dbpedia.org/resource/The_Complete_Short_Stories_of_Ernest_Hemingway, http://dbpedia.org/resource/The_Fifth_Column_and_Four_Stories_of_the_Spanish_Civil_War, http://dbpedia.org/resource/To_Have_and_Have_Not, http://dbpedia.org/resource/A_Moveable_Feast, http://dbpedia.org/resource/The_Garden_of_Eden_novel, http://dbpedia.org/resource/Dateline:_Toronto, http://dbpedia.org/resource/In_Another_Country, http://dbpedia.org/resource/For_Whom_the_Bell_Tolls, http://dbpedia.org/resource/Che_Ti_Dice_La_Patria%3F, http://dbpedia.org/resource/The_Old_Man_and_the_Sea, http://dbpedia.org/resource/Now_I_Lay_Me, http://dbpedia.org/resource/The_Dangerous_Summer, http://dbpedia.org/resource/Hills_Like_White_Elephants, http://dbpedia.org/resource/The_Fifth_Column_and_the_First_Forty-Nine_Stories, http://dbpedia.org/resource/Across_the_River_and_into_the_Trees, http://dbpedia.org/resource/A_Day's_Wait]"
